{
  "app_name": "Blood Donation",
  "home": "Home",
  "donate": "Donate",
  "find_donors": "Find Donors",
  "blood_requests": "Blood Requests",
  "profile": "Profile",
  "settings": "Settings",
  "notifications": "Notifications",
  "blood_banks": "Blood Banks",
  "donation_history": "Donation History",
  "about_us": "About Us",
  "logout": "Logout",
  "login": "Login",
  "signup": "Sign Up",
  "email": "Email",
  "password": "Password",
  "name": "Name",
  "phone": "Phone",
  "address": "Address",
  "blood_type": "Blood Type",
  "confirm_password": "Confirm Password",
  "save": "Save",
  "cancel": "Cancel",
  "search": "Search",
  "filter": "Filter",
  "submit": "Submit",
  "close": "Close",
  "welcome": "Welcome to BloodLine",
  "welcome_message": "Your donation can save a life",
  "recent_requests": "Recent Blood Requests",
  "view_all": "View All",
  "nearby_banks": "Nearby Blood Banks",
  "available_donors": "Available Donors",
  "last_donation": "Last Donation",
  "app_settings": "App Settings",
  "dark_mode": "Dark Mode",
  "language": "Language",
  "notifications_settings": "Notifications",
  "enable_notifications": "Enable Notifications",
  "email_notifications": "Email Notifications",
  "sms_notifications": "SMS Notifications",
  "push_notifications": "Push Notifications",
  "privacy_permission": "Privacy & Permission",
  "location_services": "Location Services",
  "data_usage": "Data Usage",
  "about_legal": "About & Legal",
  "privacy_policy": "Privacy Policy",
  "terms_of_service": "Terms of Service",
  "contact_support": "Contact Support",
  "account": "Account",
  "change_password": "Change Password",
  "delete_account": "Delete Account",
  "app_version": "App Version",
  "Switch between light and dark themes": "Switch between light and dark themes",
  "Select your preferred language": "Select your preferred language",
  "Receive notifications about blood requests and updates": "Receive notifications about blood requests and updates",
  "Allow app to access your location for nearby blood banks": "Allow app to access your location for nearby blood banks",
  "Control how the app uses your data": "Control how the app uses your data",
  "Are you sure you want to logout?": "Are you sure you want to logout?",
  "This action cannot be undone. Are you sure you want to delete your account?": "This action cannot be undone. Are you sure you want to delete your account?",
  "delete": "Delete",

  "terms_last_updated": "Last Updated: March 13, 2025",
  "terms_intro_title": "Introduction",
  "terms_intro_content": "Welcome to Blood Donation. These Terms and Conditions govern your use of the Blood Donation mobile application and all related services. By accessing or using our app, you agree to be bound by these Terms. If you disagree with any part of these terms, please do not use our app.",
  
  "terms_eligibility_title": "Eligibility",
  "terms_eligibility_content": "To use the BloodLine app, you must meet the following criteria:",
  "terms_eligibility_point1": "Be at least 18 years of age or have parental consent",
  "terms_eligibility_point2": "Provide accurate, truthful, and complete information about yourself, including your health information",
  "terms_eligibility_point3": "Comply with all local laws and regulations regarding blood donation",
  "terms_eligibility_point4": "Have the legal capacity to enter into these Terms",
  
  "terms_account_title": "Account Responsibilities",
  "terms_account_content": "When creating and maintaining an account on our platform, you agree to:",
  "terms_account_point1": "Keep your account information up-to-date and accurate at all times",
  "terms_account_point2": "Maintain the security of your account and password, and immediately notify us of any unauthorized access",
  "terms_account_point3": "Take full responsibility for all activities that occur under your account",
  "terms_account_point4": "Not transfer your account to another person without our prior written consent",
  
  "terms_conduct_title": "Code of Conduct",
  "terms_conduct_content": "As a BloodLine app user, you agree not to:",
  "terms_conduct_point1": "Use the app for any illegal purpose or in violation of any local laws",
  "terms_conduct_point2": "Submit false or misleading information about yourself or your health status",
  "terms_conduct_point3": "Harass, intimidate, or harm other users or blood recipients",
  "terms_conduct_point4": "Impersonate any person or entity, or misrepresent your affiliation with any person or entity",
  "terms_conduct_point5": "Attempt to gain unauthorized access to our systems or other users' accounts",
  
  "terms_donation_title": "Blood Donation Rules",
  "terms_donation_content": "Regarding blood donation activities on our platform:",
  "terms_donation_point1": "You must meet all medical and legal requirements to donate blood in your jurisdiction",
  "terms_donation_point2": "You agree to follow all guidelines and procedures provided by blood collection centers",
  "terms_donation_point3": "The app serves as a coordination tool only and does not guarantee suitability for donation",
  "terms_donation_point4": "We reserve the right to suspend accounts of users who repeatedly fail to meet donation appointments",
  
  "terms_ip_title": "Intellectual Property",
  "terms_ip_content": "All content on the BloodLine app, including but not limited to text, graphics, logos, icons, images, audio clips, and software, is the property of BloodLine and is protected by international copyright, trademark, and other intellectual property laws. You may not use, reproduce, distribute, or modify any content from our app without our express written permission.",
  
  "terms_liability_title": "Limitation of Liability",
  "terms_liability_content": "To the fullest extent permitted by applicable law, Blood Donation shall not be liable for any indirect, incidental, special, consequential, or punitive damages, or any loss of profits or revenues, whether incurred directly or indirectly, or any loss of data, use, goodwill, or other intangible losses resulting from your use or inability to use the service.",
  
  "terms_termination_title": "Termination",
  "terms_termination_content": "We may terminate or suspend your account and bar access to the service immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms. Upon termination, your right to use the service will immediately cease.",
  
  "terms_changes_title": "Changes to Terms",
  "terms_changes_content": "We reserve the right to modify these Terms at any time. If we make material changes, we will notify you through the app or by email. Your continued use of the app after such notice constitutes your acceptance of the new Terms.",
  
  "terms_contact_title": "Contact Us",
  "terms_contact_content": "If you have any questions about these Terms, please contact us at support@blooddonation.com.",

  "privacy_last_updated": "Last Updated: March 13, 2025",
  "privacy_intro_title": "Introduction",
  "privacy_intro_content": "Blood Donation is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our mobile application. Please read this policy carefully. If you do not agree with the terms of this policy, please do not access the app.",
  
  "privacy_collect_title": "Information We Collect",
  "privacy_collect_content": "We collect several types of information from and about users of our app:",
  
  "privacy_personal_title": "Personal Information",
  "privacy_personal_point1": "Name, email address, telephone number, and other contact details",
  "privacy_personal_point2": "Date of birth and age",
  "privacy_personal_point3": "Geographic location",
  "privacy_personal_point4": "Profile pictures and other content you voluntarily provide",
  "privacy_personal_point5": "Emergency contact information",
  
  "privacy_health_title": "Health Information",
  "privacy_health_point1": "Blood type and Rh factor",
  "privacy_health_point2": "Donation history and eligibility status",
  "privacy_health_point3": "Basic health information that may affect donation eligibility",
  "privacy_health_point4": "Any allergies or medical conditions you choose to disclose",
  
  "privacy_usage_title": "Usage Information",
  "privacy_usage_point1": "Information about how you use the app, including login times and features accessed",
  "privacy_usage_point2": "Device information like IP address, device type, operating system, and browser type",
  "privacy_usage_point3": "Location data when you search for nearby donation centers or blood requests",
  
  "privacy_use_title": "How We Use Your Information",
  "privacy_use_content": "We use the information we collect about you for various purposes, including to:",
  "privacy_use_point1": "Facilitate blood donation matching and coordination",
  "privacy_use_point2": "Create and maintain your account",
  "privacy_use_point3": "Provide you with notifications about blood donation opportunities and requests",
  "privacy_use_point4": "Improve our app and user experience",
  "privacy_use_point5": "Monitor and analyze usage and trends to improve functionality",
  "privacy_use_point6": "Communicate with you about updates, security alerts, and support messages",
  
  "privacy_share_title": "Sharing Your Information",
  "privacy_share_content": "We may share information we have collected about you in certain situations, including:",
  "privacy_share_point1": "With blood banks and healthcare facilities for donation coordination",
  "privacy_share_point2": "With blood requesters, limited to necessary contact and blood type information",
  "privacy_share_point3": "With third-party service providers who perform services on our behalf",
  "privacy_share_point4": "If required to do so by law or in response to valid legal requests",
  
  "privacy_security_title": "Data Security",
  "privacy_security_content": "We use administrative, technical, and physical security measures to protect your personal information, including:",
  "privacy_security_point1": "Encryption of sensitive personal and health information",
  "privacy_security_point2": "Regular security assessments and testing",
  "privacy_security_point3": "Strict internal data access controls and monitoring",
  
  "privacy_retention_title": "Data Retention",
  "privacy_retention_content": "We will retain your personal information for as long as your account is active or as needed to provide you services. We will retain and use your information as necessary to comply with our legal obligations, resolve disputes, and enforce our agreements.",
  
  "privacy_rights_title": "Your Rights",
  "privacy_rights_content": "Depending on your location, you may have certain rights regarding your personal information, including:",
  "privacy_rights_point1": "The right to access the personal information we have about you",
  "privacy_rights_point2": "The right to request that we correct inaccurate or incomplete information",
  "privacy_rights_point3": "The right to request deletion of your personal information",
  "privacy_rights_point4": "The right to withdraw consent for processing your information",
  "privacy_rights_point5": "The right to request restrictions on how we use your information",
  
  "privacy_children_title": "Children's Privacy",
  "privacy_children_content": "Our app is not intended for children under 16 years of age. We do not knowingly collect personal information from children under 16. If you are a parent or guardian and believe your child has provided us with personal information, please contact us immediately.",
  
  "privacy_changes_title": "Changes to this Privacy Policy",
  "privacy_changes_content": "We may update our Privacy Policy from time to time. If we make material changes, we will notify you through the app or by email prior to the changes becoming effective. Your continued use of the app after we post modifications to the Privacy Policy constitutes your acknowledgment of the modifications and your consent to abide by them.",
  
  "privacy_contact_title": "Contact Us",
  "privacy_contact_content": "If you have questions or concerns about this Privacy Policy, please contact us at privacy@blooddonation.com.",

  "hello": "Hello,",
  "next_donation_in_days": "Next donation in {days} days",
  "eligible_today": "You are eligible to donate today!",
  "eligible_to_donate": "Eligible to Donate",
  "not_eligible_yet": "Not Eligible Yet",
  "services": "Services",
  "tap_access_service": "Tap on any card to access the service",
  "find_blood_donors": "Find Blood Donors",
  "request_blood": "Request Blood",
  "nearby_blood_banks": "Nearby Blood Banks",
  "health_tips": "Health Tips",
  "emergency_contacts": "Emergency Contacts",
  "did_you_know": "Did you know?",
  "select_language": "Select Language",
  "you_can_donate_to": "You can donate to:",
  "you_can_receive_from": "You can receive from:"
} 